{
  "backend/main.mo": "Motoko actor implementing Prisoner’s Dilemma logic with configurable payoff matrix, one-shot/repeated simulations, history tracking, and basic equilibrium analysis.",
  "feature_evidence.json": "Machine-generated feature-to-file mapping describing implemented UI features, components, and confidence data.",
  "frontend-file-summaries.txt": "Prewritten summaries of many frontend files describing their roles in layout, sections, styling, and interactive logic.",
  "frontend/index.css": "Tailwind base and theme variable definitions creating a light/dark corporate color system with OKLCH values.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Root React component applying theme provider and rendering the main Prisoner’s Dilemma page with a toaster.",
  "frontend/src/components/layout/Footer.tsx": "Footer displaying attribution, current year, and a tracked link to caffeine.ai.",
  "frontend/src/components/layout/TopNav.tsx": "Sticky responsive navigation bar with smooth scrolling and mobile sheet menu.",
  "frontend/src/features/analytics/analyticsMath.ts": "Provides functions to compute expected values and risk metrics for each firm's strategies based on a payoff matrix.",
  "frontend/src/features/analytics/BusinessAnalyticsMode.tsx": "Analytics panel toggling advanced payoff analysis with heatmaps, expected values, and risk metrics.",
  "frontend/src/features/content/BusinessApplicationsSection.tsx": "Renders a section describing real-world business scenarios that mirror the Prisoner's Dilemma.",
  "frontend/src/features/content/ConceptsSection.tsx": "Displays an overview of key Prisoner's Dilemma concepts including players, actions, payoffs, and strategic principles.",
  "frontend/src/features/content/HeroSection.tsx": "Defines the hero section with introductory text, examples, and a button that scrolls to the simulation area.",
  "frontend/src/features/dashboard/CumulativeProfitChart.tsx": "Draws an SVG line chart showing cumulative profits for both firms across simulation rounds.",
  "frontend/src/features/dashboard/DashboardSection.tsx": "Shows simulation summary statistics and visualizations, including cooperation rates and profit charts.",
  "frontend/src/features/dashboard/RoundsHistoryTable.tsx": "Displays a scrollable table listing each round's actions, payoffs, and cumulative profits.",
  "frontend/src/features/insights/InsightsSection.tsx": "Displays strategic insights by analyzing the payoff matrix and simulation results, showing Nash equilibria and profit comparisons.",
  "frontend/src/features/insights/interpretation.ts": "Generates narrative business-focused interpretations of simulation outcomes based on cooperation rate and game type.",
  "frontend/src/features/payoff/payoffAnalysis.ts": "Computes dominant strategies and Nash equilibria from a payoff matrix and produces an explanatory summary.",
  "frontend/src/features/payoff/PayoffMatrixSection.tsx": "Renders an interactive payoff matrix with editable values and highlights Nash equilibria using payoff analysis.",
  "frontend/src/features/payoff/usePayoffMatrix.ts": "Fetches and updates the payoff matrix via backend actor calls using React Query.",
  "frontend/src/features/prisonersDilemma/PrisonersDilemmaPage.tsx": "Main page composing all sections of the Prisoner's Dilemma interface including simulation, insights, and analytics.",
  "frontend/src/features/simulation/SimulationSection.tsx": "Provides UI controls for configuring and running one-shot or repeated game simulations with strategy selection.",
  "frontend/src/features/simulation/strategies.ts": "Defines available decision strategies for simulations, each with an ID, label, and description.",
  "frontend/src/features/simulation/useSimulation.ts": "Runs simulations through backend actor methods and stores results while managing loading and error states.",
  "frontend/src/features/state/useGameStore.ts": "Defines a Zustand store holding game mode, strategies, rounds, simulation results, and analytics mode with setter functions.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor via react-query, updating when the user's identity changes and invalidating dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, logout, identity loading, and status tracking using AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file indicating queries are handled in feature-specific hooks.",
  "frontend/src/index.css": "Defines global Tailwind CSS styles, OKLCH theme variables, dark mode tokens, and utility animations.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider, then renders App.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, fonts, animations, and plugins including typography and container queries.",
  "project_state.json": "Stores project metadata, requirements, features, issues, and architectural notes for the game theory web app."
}